In [1]:
import pandas as pd
import sqlite3

In [7]:
orders = pd.read_csv(r"C:\\Users\sanap\Downloads\orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [8]:
users = pd.read_json(r"C:\\Users\sanap\Downloads\users.json")
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [10]:
import os
os.listdir()

['.anaconda',
 '.conda',
 '.continuum',
 '.eclipse',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.p2',
 '.python_history',
 '.vscode',
 'anaconda3',
 'anaconda_projects',
 'AppData',
 'Application Data',
 'Contacts',
 'Cookies',
 'Documents',
 'Downloads',
 'eclipse-workspace',
 'Favorites',
 'hackathon.ipynb',
 'IdeaProjects',
 'IdeaSnapshots',
 'Links',
 'Local Settings',
 'Music',
 'My Documents',
 'myNewBegining',
 'NetHood',
 'newBegining.py',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{8684e57a-01c1-11f0-adb3-388d3d55a289}.TM.blf',
 'NTUSER.DAT{8684e57a-01c1-11f0-adb3-388d3d55a289}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{8684e57a-01c1-11f0-adb3-388d3d55a289}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'OneDrive',
 'Pictures',
 'PrintHood',
 'Recent',
 'Saved Games',
 'Searches',
 'SendTo',
 'Start Menu',
 'Templates',
 'untitled.py',
 'Untitled1.ipynb',
 'untitled1.py',
 'Untitled2.ipynb',
 'Untitled3.ipynb',
 'Untitled4.ipynb',
 'Untitled5.ipynb',
 'Untitled6.ipynb',
 'Videos']

In [11]:
import os
os.listdir()

['.anaconda',
 '.conda',
 '.continuum',
 '.eclipse',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.p2',
 '.python_history',
 '.vscode',
 'anaconda3',
 'anaconda_projects',
 'AppData',
 'Application Data',
 'Contacts',
 'Cookies',
 'Documents',
 'Downloads',
 'eclipse-workspace',
 'Favorites',
 'hackathon.ipynb',
 'IdeaProjects',
 'IdeaSnapshots',
 'Links',
 'Local Settings',
 'Music',
 'My Documents',
 'myNewBegining',
 'NetHood',
 'newBegining.py',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{8684e57a-01c1-11f0-adb3-388d3d55a289}.TM.blf',
 'NTUSER.DAT{8684e57a-01c1-11f0-adb3-388d3d55a289}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{8684e57a-01c1-11f0-adb3-388d3d55a289}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'OneDrive',
 'orders.csv',
 'Pictures',
 'PrintHood',
 'Recent',
 'restaurants.sql',
 'Saved Games',
 'Searches',
 'SendTo',
 'Start Menu',
 'Templates',
 'untitled.py',
 'Untitled1.ipynb',
 'untitled1.py',
 'Untitled2.ipynb',
 'Untitled3.ipynb',
 'Untitled4.ipynb',
 'Untitled5.ipynb',
 'Untitled6.ipynb',
 'users.json',
 'Videos']

In [12]:
# Create in-memory SQLite database
conn = sqlite3.connect(":memory:")

# Execute SQL file
with open("restaurants.sql", "r", encoding="utf-8") as f:
    conn.executescript(f.read())

# Load restaurants table into DataFrame
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [13]:
final_df = orders.merge(users, on="user_id", how="left") \
                 .merge(restaurants, on="restaurant_id", how="left")

final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [14]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)
print("final_food_delivery_dataset.csv saved successfully!")

final_food_delivery_dataset.csv saved successfully!

In [15]:
gold_orders = final_df[final_df["membership"] == "Gold"]
gold_orders.shape[0]

4987

In [16]:
round(final_df[final_df["city"] == "Hyderabad"]["total_amount"].sum())

1889367

In [17]:
final_df["user_id"].nunique()

2883

In [18]:
round(gold_orders["total_amount"].mean(), 2)

np.float64(797.15)

In [19]:
final_df[final_df["rating"] >= 4.5].shape[0]

3374

In [20]:
gold_city_revenue = gold_orders.groupby("city")["total_amount"].sum()
gold_city_revenue.sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [21]:
top_city = gold_city_revenue.idxmax()
gold_orders[gold_orders["city"] == top_city].shape[0]

1337

In [23]:
final_df.groupby(["membership", "cuisine"])["total_amount"] \
        .sum() \
        .reset_index() \
        .sort_values("total_amount", ascending=False) \
        .head(1)

  membership  cuisine  total_amount
7    Regular  Mexican     1072943.3

In [24]:
final_df["order_date"] = pd.to_datetime(final_df["order_date"], dayfirst=True)
final_df["quarter"] = final_df["order_date"].dt.quarter

final_df.groupby("quarter")["total_amount"].sum()

quarter
1    2010626.64
2    1945348.72
3    2037385.10
4    2018263.66
Name: total_amount, dtype: float64